Repository: istresearch/goflow
Catalog: locale/*/flows.po
Languages: cs, es, pt_br

source: any attachments on the input
cs: všechny přílohy na vstupu
es: cualquier archivo adjunto en la entrada
pt_br: quaisquer anexos na entrada

source: the URN values of the contact
cs: hodnoty URN kontaktu
es: los valores URN del contacto
pt_br: os valores de URN do contato

source: the URN values of the run
cs: hodnoty URN běhu
es: los valores URN de la ejecución
pt_br: os valores de URN da execução

source: the URNs belonging to the contact
cs: čísla URN náležející ke kontaktu
es: las URN pertenecientes al contacto
pt_br: as URNs pertencentes ao contato

source: the UUID of the channel
cs: UUID kanálu
es: el UUID del canal
pt_br: o UUID do canal

source: the UUID of the contact
cs: UUID kontaktu
es: el UUID del contacto
pt_br: o UUID do contato

source: the UUID of the flow
cs: UUID toku
es: el UUID del flujo
pt_br: o UUID do fluxo

source: the UUID of the group
cs: UUID skupiny
es: el UUID del grupo
pt_br: o UUID do grupo

source: the UUID of the input
cs: UUID vstupu
es: el UUID de la entrada
pt_br: o UUID da entrada

source: the UUID of the node
cs: UUID uzlu
es: el UUID del nodo
pt_br: o UUID do nó

source: the UUID of the node in the flow that generated the result
cs: UUID uzlu v toku, který vygeneroval výsledek.
es: el UUID del nodo en el flujo que generó el resultado
pt_br: o UUID do nó no fluxo que gerou o resultado

source: the UUID of the run
cs: UUID běhu
es: el UUID de la ejecución
pt_br: o UUID da execução

source: the UUID of the ticket
cs: UUID tiketu
es: el UUID del ticket

source: the UUID of the topic
cs: UUID tématu
es: el UUID del tema

source: the address of the channel
cs: adresa kanálu
es: la dirección del canal
pt_br: o endereço do canal

source: the body of the ticket
cs: tělo tiketu
es: el cuerpo del ticket

source: the category of the result
cs: kategorie výsledku
es: la categoría del resultado
pt_br: a categoria do resultado

source: the channel that the input was received on
cs: kanál, na kterém byl vstup přijat
es: el canal en el que se recibió la entrada
pt_br: o canal onde a entrada foi recebida

source: the contact
cs: kontakt
es: el contacto
pt_br: o contato

source: the contact URN that the input was received on
cs: URN kontaktu, na kterém byl vstup přijat.
es: el contacto URN en el que se recibió la entrada
pt_br: a URN do contato que a entrada foi recebida

source: the contact name and flow UUID
cs: jméno kontaktu a identifikátor UUID toku
es: el nombre del contacto y el UUID del flujo
pt_br: o nome do contato e UUID do fluxo

source: the contact of the run
cs: kontakt běhu
es: el contacto de la ejecución
pt_br: o contato da exeução

source: the count of visits to the node in this run
cs: počet návštěv uzlu v tomto běhu.
es: el recuento de visitas al nodo en esta ejecución
pt_br: o contador de visitas para o nó nesta execução

source: the creation date of the contact
cs: datum vytvoření kontaktu
es: la fecha de creación del contacto
pt_br: a data de criação do contato

source: the creation date of the input
cs: datum vytvoření vstupu
es: la fecha de creación de la entrada
pt_br: a data de criação da entrada

source: the creation date of the result
cs: datum vytvoření výsledku
es: la fecha de creación del resultado
pt_br: a data de ciração do resultado

source: the creation date of the run
cs: datum vytvoření běhu
es: la fecha de creación de la ejecución
pt_br: data de criação da execução

source: the current input from the contact
cs: aktuální vstup z kontaktu
es: la entrada actual del contacto
pt_br: a entrada atual do contato

source: the current node
cs: aktuální uzel
es: el nodo actual
pt_br: o nó atual

source: the current resume that continued this session
cs: aktuální pokračování, které navázalo na toto sezení.
es: la reanudación actual que continuó esta sesión
pt_br: o resumo atual que continuou esta sessão

source: the current run
cs: aktuální běh
es: la ejecución actual
pt_br: a execução atual

source: the current run results
cs: výsledky aktuálního běhu
es: los resultados de la ejecución actual
pt_br: os resultados da execução atual

source: the current status of the run
cs: aktuální stav běhu
es: el estado actual de la ejecución
pt_br: o status da atual execução

source: the custom field values of the contact
cs: hodnoty vlastního pole kontaktu
es: los valores de campo personalizados del contacto
pt_br: os valores customizados do contato

source: the custom field values of the run
cs: hodnoty vlastního pole běhu
es: los valores de campo personalizados de la ejecución
pt_br: os valores customizados da execução

source: the email address of the user
cs: e-mailová adresa uživatele
es: el correo del usuario

source: the exit date of the run
cs: datum ukončení běhu
es: la fecha de salida de la ejecución
pt_br: a data de saída da execução

source: the external ID of the input
cs: externí ID vstupu
es: el ID externo de la entrada
pt_br: o ID externo da entrada

source: the extra data of the result such as a webhook response
cs: další data výsledku, jako je odpověď webhooku.
es: los datos adicionales del resultado, como una respuesta de webhook
pt_br: os dados extras do resultado como resposta de webhook

source: the first name of the contact
cs: jméno kontaktu
es: el nombre del contacto
pt_br: o primeiro nome do contato

source: the first name of the user
cs: křestní jméno uživatele
es: el nombre del usuario

source: the flow of the run
cs: tok běhu
es: el flujo de la ejecución
pt_br: o fluxo da execução

source: the global value {key}
cs: globální hodnota {key}
es: el valor global {key}
pt_br: o valor global {key}

source: the global values
cs: globální hodnoty
es: los valores globales
pt_br: os valores globais

source: the groups the contact belongs to
cs: skupiny, do kterých kontakt patří
es: los grupos a los que pertenece el contacto
pt_br: os grupos ao qual o contato pertence

source: the input of the result
cs: zadání výsledku
es: la entrada del resultado
pt_br: a entrada do resultado

source: the keyword match if this is a keyword trigger
cs: shoda klíčového slova, pokud se jedná o spouštěč klíčového slova.
es: la concordancia de palabra clave si se trata de un activador de palabra clave
pt_br: a palavra para combinar se uma uma palavra de gatilho

source: the language of the contact as 3-letter ISO code
cs: jazyk kontaktu jako 3-písmenný kód ISO.
es: el idioma del contacto como código ISO de 3 letras
pt_br: a língua do contato como código ISO de 3 letras

source: the last child run
cs: poslední běh podřazeného
es: la última ejecución de hijo
pt_br: a última execução do filho

source: the last opened ticket for the contact
cs: poslední otevřený tiket pro kontakt
es: el último ticket que se ha abierto para el contacto

source: the last seen date of the contact
cs: datum posledního setkání s kontaktem
es: la fecha de última vista del contacto
pt_br: a última data vista do contato

source: the localized category of the result
cs: lokalizovaná kategorie výsledku
es: la categoría localizada del resultado
pt_br: a categoria localizada do resultado

source: the name
cs: název
es: el nombre
pt_br: o nome

source: the name of the channel
cs: název kanálu
es: el nombre del canal
pt_br: o nome do canal

source: the name of the contact
cs: jméno kontaktu
es: el nombre del contacto
pt_br: o nome do contato

source: the name of the flow
cs: název toku
es: el nombre del flujo
pt_br: o nome do fluxo

source: the name of the group
cs: název skupiny
es: el nombre del grupo
pt_br: o nome do grupo

source: the name of the result
cs: název výsledku
es: el nombre del resultado
pt_br: o nome do resultado

source: the name of the topic
cs: název tématu
es: el nombre del tema

source: the name of the user
cs: Jméno uživatele
es: el nombre del usuario

source: the name or URN
cs: Název URN
es: el nombre o URN
pt_br: o nome da URN

source: the name or email
cs: název e-mailu
es: el nombre o correo

source: the numeric ID of the contact
cs: číselné ID kontaktu
es: el ID numérico del contacto
pt_br: o ID numérico do contato

source: the open tickets of the contact
cs: otevřené tikety kontaktu
es: los tickets abiertos del contacto

source: the origin of this session if this is a manual trigger
cs: původ této relace, pokud se jedná o ruční spouštění.
es: el origen de esta sesión si se trata de un activador manual
pt_br: a origem desta sessão se for um gatilho manual

source: the parameters passed to the trigger
cs: parametry předané spouštěči
es: los parámetros pasados al activador
pt_br: os parâmetros passados para o gatilho

source: the parent of the run
cs: nadřízený běhu
es: el padre de la ejecución
pt_br: o pai da exeução

source: the parsed JSON response of the last webhook call
cs: zpracovaná odpověď JSON posledního volání webhooku.
es: la respuesta JSON analizada de la última llamada de webhook
pt_br: a resposta JSON avaliada da última chamada webhook

source: the preferred URN of the contact
cs: preferované URN kontaktu
es: la URN preferida del contacto
pt_br: a URN preferida do contato

source: the preferred channel of the contact
cs: preferovaný kanál kontaktu
es: el canal preferido del contacto
pt_br: o canal preferido do contato

source: the result for {key}
cs: výsledek pro {key}
es: el resultado de {key}
pt_br: o resultado para {key}

source: the results saved by the run
cs: výsledky uložené při běhu
es: los resultados guardados por la ejecución
pt_br: os resultados salvos pela execução

source: the revision number of the flow
cs: číslo revize toku
es: el número de revisión del flujo
pt_br: o número de revisão do fluxo

source: the subject of the ticket
cs: předmět tiketu
es: el asunto del ticket

source: the text and attachments
cs: text a přílohy
es: el texto y los archivos adjuntos
pt_br: o texto e anexos

source: the text part of the input
cs: textová část vstupu
es: la parte de texto de la entrada
pt_br: a parte de texto da entrada

source: the ticket if this is a ticket trigger
cs: tiket, pokud se jedná o spouštěč tiketů
es: el ticket si es un activador de tickets

source: the trigger that started this session
cs: spouštěč, který zahájil tuto relaci
es: el activador que inició esta sesión
pt_br: o gatilho que iniciou a sessão

source: the type of resume that resumed this session
cs: typ obnovení, které obnovilo tuto relaci.
es: el tipo de reanudación que reanudó esta sesión
pt_br: o tipo de resumo que resumiu esta sessão

source: the type of trigger that started this session
cs: typ spouštěče, který zahájil tuto relaci
es: el tipo de activador que inició esta sesión
pt_br: o tipo do gatilho que iniciou a sessão

source: the user who started this session if this is a manual trigger
cs: uživatele, který zahájil tuto relaci, pokud se jedná o ruční spouštění.
es: el usuario que inició esta sesión si se trata de un activador manual
pt_br: o usuário que iniciou a sessão se for um gatilho manual

source: the value
cs: hodnota
es: el valor
pt_br: o valor

source: the value of the result
cs: hodnota výsledku
es: el valor del resultado
pt_br: o valor do resultado

source: {key} for the contact
cs: {key} pro kontakt
es: {key} para el contacto
pt_br: {key} para o contato

source: {type} URN for the contact
cs: {type} URN pro kontakt
es: {type} URN para el contacto
pt_br: {type} URN para o contato
