Repository: istresearch/goflow
Catalog: locale/*/flows.po
Languages: cs, es, pt_br

source: Returns a new array with the values of `array` reversed.
cs: Vrátí nové pole s obrácenými hodnotami pole `array`.
es: Devuelve un nuevo array de los valores de `array` invertidos.

source: Returns a new array with the values of `array` sorted.
cs: Vrátí nové pole s hodnotami `array` seřazenými.
es: Devuelve un nuevo array de los valores de `array` ordenados.

source: Returns a new datetime with the time part replaced by the `time`.
cs: Vrátí nový datetime s časovou částí nahrazenou hodnotou `time`.
es: Devuelve una nueva fecha y hora con la parte de la hora reemplazada por `hour`.
pt_br: Retorna um novo datetime com a parte do tempo substituída pelo `time`.

source: Returns a single random number between [0.0-1.0).
cs: Vrátí jedno náhodné číslo v rozsahu [0.0-1.0).
es: Devuelve un solo número aleatorio entre [0.0-1.0).
pt_br: Retorna um número único aleatório entre [0.0-1.0).

source: Returns the JSON representation of `value`.
cs: Vrací JSON reprezentaci hodnoty `value`.
es: Devuelve la representación JSON de `value`.
pt_br: Retorna a representação em JSON de `value`.

source: Returns the UNICODE code for the first character of `text`.
cs: Vrací kód UNICODE pro první znak `text`.
es: Devuelve el código UNICODE para el primer carácter de `text`.
pt_br: Retorna o código UNICODE do primeiro caractere de `text`.

source: Returns the absolute value of `number`.
cs: Vrací absolutní hodnotu `number`.
es: Devuelve el valor absoluto de `number`.
pt_br: Retorna o valor absoluto de `number`.

source: Returns the arithmetic mean of `numbers`.
cs: Vrací aritmetický průměr `numbers`.
es: Devuelve la media aritmética de `numbers`.
pt_br: Retorna a média aritimética dos `numbers`.

source: Returns the character for the given UNICODE `code`.
cs: Vrací znak pro zadaný UNICODE `code`.
es: Devuelve el carácter del `code` UNICODE dado.
pt_br: Retorna o caractere para o `code` UNICODE dado.

source: Returns the current date and time in the current timezone.
cs: Vrátí aktuální datum a čas v aktuálním časovém pásmu.
es: Devuelve la fecha y hora actuales en la zona horaria actual.
pt_br: Retorna a data atual e o tempo no fuso horário atual.

source: Returns the current date in the environment timezone.
cs: Vrátí aktuální datum v časovém pásmu prostředí.
es: Devuelve la fecha actual en la zona horaria del entorno.
pt_br: Retorna a data atual no fuso horário do ambiente.

source: Returns the day of the week for `date`.
cs: Vrací den v týdnu pro `date`.
es: Devuelve el día de la semana para `date`.
pt_br: Retorna o dia da semana para `date`.

source: Returns the dictionary order of `text1` and `text2`.
cs: Vrací pořadí slovníku `text1` a `text2`.
es: Devuelve el orden del diccionario de `text1` y` text2`.
pt_br: Retorna a ordem de dicionário de `text1` e `text2`.

source: Returns the duration between `date1` and `date2` in the `unit` specified.
cs: Vrací dobu trvání mezi `date1` a `date2` v zadané `unit`.
es: Devuelve la duración entre `date1` y` date2` en la `unidad` especificada.
pt_br: Retorna a duração entre `date1` e `date2` na `unit` especificada.

source: Returns the first match of the regular expression `pattern` in `text`.
cs: Vrací první shodu regulárního výrazu `pattern` v `text`.
es: Devuelve la primera coincidencia de la expresión regular `pattern` en ` text`.
pt_br: Retorna a primeira correspondência da expressão regular `pattern` no `text`.

source: Returns the length (number of characters) of `value` when converted to text.
cs: Vrací délku (počet znaků) hodnoty `value` po převodu na text.
es: Devuelve la longitud (número de caracteres) de `value` cuando se convierte en texto.
pt_br: Retorna o tamanho (número de caracteres) de `value` quando convertido em texto.

source: Returns the maximum value in `numbers`.
cs: Vrací maximální hodnotu v `numbers`.
es: Devuelve el valor máximo en `numbers`.
pt_br: Retorna o maior valor em `numbers`.

source: Returns the minimum value in `numbers`.
cs: Vrací minimální hodnotu v `numbers`.
es: Devuelve el valor mínimo en `numbers`.
pt_br: Retorna o menor valor em `numbers`.

source: Returns the name of the timezone of `date`.
cs: Vrací název časové zóny `date`.
es: Devuelve el nombre de la zona horaria de `date`.
pt_br: Retorna o nome do fuso horário de `date`.

source: Returns the number of items in the given array or properties on an object.
cs: Vrací počet položek v daném poli nebo vlastností objektu.
es: Devuelve el número de elementos en la matriz o propiedades dadas en un objeto.
pt_br: Retorna o número de items em uma matriz ou propriedades em um objeto.

source: Returns the number of words in `text`.
cs: Vrací počet slov v `text`.
es: Devuelve el número de palabras en `text`.
pt_br: Retorna o número de palavras em `text`.

source: Returns the offset of the timezone of `date`.
cs: Vrací posun časového pásma `date`.
es: Devuelve el desplazamiento de la zona horaria de `date`.
pt_br: Retorna o offset do fuso horário de `date`.

source: Returns the portion of `text` between `start` (inclusive) and `end` (exclusive).
cs: Vrací část `text` mezi `start` (včetně) a `end` (bez).
es: Devuelve la porción de `text` entre `start` (inclusivo) y `end` (exclusivo).
pt_br: Retorna a porção de `text` entre `start` (inclusivo) e `end` (exclusivo).

source: Returns the remainder of the division of `dividend` by `divisor`.
cs: Vrací zbytek dělení čísla `dividend` číslem `divisor`.
es: Devuelve el resto de la división de `dividend` por `divisor`.
pt_br: Retorna o resto da divisão de `dividend` pelo `divisor`.

source: Returns the unique values in `array`.
cs: Vrátí jedinečné hodnoty v poli `array`.
es: Devuelve los valores únicos en `array`.

source: Returns the week number (1-54) of `date`.
cs: Vrací číslo týdne (1-54) pro `date`.
es: Devuelve el número de semana (1-54) de `date`.
pt_br: Retorna o número da semana (1-54) de `date`.

source: Returns the word at `index` in `text`.
cs: Vrátí slovo v `index` v `text`.
es: Devuelve la palabra en `index` en `text`.
pt_br: Retorna a palavra em um `index` no `text`.

source: Returns whether `value` is an error
cs: Vrací, zda `value` je chyba
es: Devuelve si `value` es un error
pt_br: Retorna se `value` é um erro.

source: Returns whether all the given `values` are truthy.
cs: Vrací, zda jsou všechny zadané `values` pravdivé.
es: Devuelve si todos los `values` dados son verdaderos.
pt_br: Retorna se todos os `values` dados são verdadeiros.

source: Returns whether if any of the given `values` are truthy.
cs: Vrací, zda je některá ze zadaných `value` pravdivá.
es: Devuelve si alguno de los `values` dados es verdadero.
pt_br: Retorna se algum dos valores em `values` é verdadeiro.

source: Rounds `number` down to the nearest integer value.
cs: Zaokrouhlí `number` na nejbližší celé číslo.
es: Redondea `number` hacia abajo al valor entero más cercano.
pt_br: Arredonda `number` para o número inteiro inferior mais próximo.

source: Rounds `number` to the nearest value.
cs: Zaokrouhlí `number` na nejbližší hodnotu.
es: Redondea `number` al valor más cercano.
pt_br: Arredonda `number` para o valor mais próximo.

source: Rounds `number` up to the nearest integer value.
cs: Zaokrouhlí `number` na nejbližší celé číslo.
es: Redondea `number` al valor entero más cercano.
pt_br: Arredonda `number` para o inteiro superior mais próximo.

source: Splits `text` into an array of separated words.
cs: Rozdělí `text` na pole oddělených slov.
es: Divide el `text` en una matriz de palabras separadas.
pt_br: Divide `text` em uma matriz com palavras separadas.

source: Splits `text` using the given `delimiter` and returns the field at `index`.
cs: Rozdělí `text` pomocí zadaného `delimiter` a vrátí pole na `index`.
es: Divide el `text` usando el `delimiter` dado y devuelve el campo en el `index`.
pt_br: Divide `text` utilizando o dado `delimiter` e retorna o campo no `index`.

source: Sums the items in the given `array`.
cs: Sečte položky v zadaném poli `array`.
es: Suma los elementos de la `array` dado.

source: Takes an object and extracts the named property.
cs: Vezme objekt a extrahuje pojmenovanou vlastnost.
es: Toma un objeto y extrae la propiedad nombrada.
pt_br: Toma um objeto e extrai a propriedade nomeada.

source: Takes an object and returns a new object by extracting only the named properties.
cs: Vezme objekt a vrátí nový objekt extrakcí pouze pojmenovaných vlastností.
es: Toma un objeto y devuelve un nuevo objeto extrayendo solo las propiedades nombradas.
pt_br: Toma um objeto e retorna um novo objeto extraindo somente as propriedades nomeadas.

source: Takes multiple `values` and returns them as an array.
cs: Přijme více `values` a vrátí je jako pole.
es: Toma múltiples `values` y los devuelve como una matriz.
pt_br: Toma multiplos `values` e retorna todos em uma matriz.

source: Takes property name value pairs and returns them as a new object.
cs: Přijímá dvojice názvů vlastností a vrací je jako nový objekt.
es: Toma pares de valor de nombre de propiedad y los devuelve como un nuevo objeto.
pt_br: Toma os pares de nome da propriedade e valor e retorna como um novo objeto.

source: The format string can consist of the following characters. The characters ' ', ':', ',', 'T', '-' and '_' are ignored. Any other character is an error. * `YY` - last two digits of year 0-99 * `YYYY` - four digits of year 0000-9999 * `M` - month 1-12 * `MM` - month, zero padded 01-12 * `D` - day of month, 1-31 * `DD` - day of month, zero padded 01-31 * `h` - hour of the day 1-12 * `hh` - hour of the day 01-12 * `t` - twenty four hour of the day 1-23 * `tt` - twenty four hour of the day, zero padded 01-23 * `m` - minute 0-59 * `mm` - minute, zero padded 00-59 * `s` - second 0-59 * `ss` - second, zero padded 00-59 * `fff` - milliseconds * `ffffff` - microseconds * `fffffffff` - nanoseconds * `aa` - am or pm * `AA` - AM or PM * `Z` - hour and minute offset from UTC, or Z for UTC * `ZZZ` - hour and minute offset from UTC Timezone should be a location name as specified in the IANA Time Zone database, such as "America/Guayaquil" or "America/Los_Angeles". If not specified, the current timezone will be used. An error will be returned if the timezone is not recognized. Note that fractional seconds will be parsed even without an explicit format identifier. You should only specify fractional seconds when you want to assert the number of places in the input format. parse_datetime will return an error if it is unable to convert the text to a datetime.
cs: Formátovací řetězec se může skládat z následujících znaků. Znaky ' ', ':', ',', "T", "-" a "_" se ignorují. Jakýkoli jiný znak je chybou. * `YY` - poslední dvě číslice roku 0-99 * `YYYY` - čtyři číslice roku 0000-9999 * `M` - měsíc 1-12 * `MM` - měsíc, doplněný nulou 01-12 * `D` - den v měsíci, 1-31 * `DD` - den v měsíci, s nulou 01-31 * `h` - hodina dne 1-12 * `hh` - hodina dne 01-12 * `t` - čtyřiadvacátá hodina dne 1-23 * `tt` - čtyřiadvacátá hodina dne, doplněná nulou 01-23 * `m` - minuta 0-59 * `mm` - minuta, doplněná nulou 00-59 * `s` - sekunda 0-59 * `ss` - sekunda, s nulovým polštářkem 00-59 * `fff` - milisekundy * `ffffff` - mikrosekundy * `fffffffff` - nanosekundy * `aa` - am nebo pm * `AA` - AM nebo PM * `Z` - hodinový a minutový posun od UTC nebo Z pro UTC * `ZZZ` - hodinový a minutový posun od UTC Časové pásmo by mělo být názvem místa, jak je uvedeno v databázi časových pásem IANA, například "America/Guayaquil" nebo "America/Los_Angeles". Pokud není zadáno, použije se aktuální časové pásmo. Pokud časové pásmo není rozpoznáno, bude vrácena chyba. Všimněte si, že zlomkové sekundy budou analyzovány i bez explicitního identifikátoru formátu. Zlomkové sekundy byste měli zadávat pouze v případě, že chcete potvrdit počet míst ve vstupním formátu. Funkce parse_datetime vrátí chybu, pokud není schopna převést text na datum.
es: La cadena del formato puede constar de los siguientes caracteres. Los caracteres '', ':', ',', 'T', '-' y '_' se ignoran. Cualquier otro carácter es un error. * `YY` - últimos dos dígitos del año 0-99 * `YYYY`: cuatro dígitos del año 0000-9999 * `M` - mes 1-12 * `MM` - mes 01-12 * `D` - día del mes, 1-31 * `DD` - día del mes, relleno con ceros 0-31 * `h` - hora del día 1-12 * `hh` - hora del día 01-12 * `t` - veinticuatro horas del día 1-23 * `tt` - veinticuatro horas del día 01-23 * `m` - minuto 0-59 * `mm` - minuto 00-59 * `s` - segundo 0-59 * `ss` - segundo 00-59 * `fff` - milisegundos * `ffffff` - microsegundos * `fffffffff` - nanosegundos * `aa` - am o pm * `AA` - AM o PM * `Z` - compensación de hora y minuto de UTC, o Z para UTC * `ZZZ` - compensación de hora y minuto de UTC La zona horaria debe ser un nombre de ubicación como se especifica en la base de datos de la zona horaria de la IANA, como como "América / Guayaquil" o "América / Los_Angeles". Si no se especifica, la zona horaria actual se utilizará. Se devolverá un error si no se reconoce la zona horaria. Tenga en cuenta que las fracciones de segundo se analizarán incluso sin un identificador de formato explícito. Solo debe especificar fracciones de segundo cuando desee afirmar el número de lugares en el formato de entrada. parse_datetime devolverá un error si no puede convertir el texto a una fecha y hora.

source: The format string can consist of the following characters. The characters ' ', ':', ',', 'T', '-' and '_' are ignored. Any other character is an error. * `h` - hour of the day 1-12 * `hh` - hour of the day, zero padded 01-12 * `t` - twenty four hour of the day 1-23 * `tt` - twenty four hour of the day, zero padded 01-23 * `m` - minute 0-59 * `mm` - minute, zero padded 00-59 * `s` - second 0-59 * `ss` - second, zero padded 00-59 * `fff` - milliseconds * `ffffff` - microseconds * `fffffffff` - nanoseconds * `aa` - am or pm * `AA` - AM or PM Note that fractional seconds will be parsed even without an explicit format identifier. You should only specify fractional seconds when you want to assert the number of places in the input format. parse_time will return an error if it is unable to convert the text to a time.
cs: Formátovací řetězec se může skládat z následujících znaků. Znaky ' ', ':', ',', "T", "-" a "_" se ignorují. Jakýkoli jiný znak je chybou. * `h` - hodina dne 1-12 * `hh` - hodina dne, doplněná nulou 01-12 * `t` - čtyřiadvacátá hodina dne 1-23 * `tt` - čtyřiadvacátá hodina dne, doplněná nulou 01-23 * `m` - minuta 0-59 * `mm` - minuta, doplněná nulou 00-59 * `s` - sekunda 0-59 * `ss` - sekunda, s nulovým polštářkem 00-59 * `fff` - milisekundy * `ffffff` - mikrosekundy * `fffffffff` - nanosekundy * `aa` - am nebo pm * `AA` - AM nebo PM Všimněte si, že zlomkové sekundy budou analyzovány i bez explicitního identifikátoru formátu. Zlomkové sekundy byste měli zadávat pouze v případě, že chcete potvrdit počet míst ve vstupním formátu. Funkce parse_time vrátí chybu, pokud není schopna převést text na čas.
es: La cadena del formato puede constar de los siguientes caracteres. Los caracteres '', ':', ',', 'T', '-' y '_' se ignoran. Cualquier otro carácter es un error. * `h` - hora del día 1-12 * `hh` - hora del día 01-12 * `t` - veinticuatro horas del día 1-23 * `tt` - veinticuatro horas del día 01-23 * `m` - minuto 0-59 * `mm` - minuto 00-59 * `s` - segundo 0-59 * `ss` - segundo 00-59 * `fff` - milisegundos * `ffffff` - microsegundos * `fffffffff` - nanosegundos * `aa` - am o pm * `AA` - AM o PM Tenga en cuenta que las fracciones de segundo se analizarán incluso sin un identificador de formato explícito. Solo debe especificar fracciones de segundo cuando desee afirmar el número de lugares en el formato de entrada. parse_time devolverá un error si no puede convertir el texto a una hora.

source: The index starts at zero. When splitting with a space, the delimiter is considered to be all whitespace.
cs: Index začíná na nule. Při dělení mezerou se za oddělovač považují všechny mezery.
es: El índice comienza en cero. Cuando se divide con un espacio, el delimitador se considera todo espacio en blanco.
pt_br: O índice inicia em zero. Quando separando com um espaço, o delimitador é considerado para ser espaços em branco.

source: The offset is returned in the format `[+/-]HH:MM`. If no timezone information is present in the date, then the current timezone offset will be returned.
cs: Posun je vrácen ve formátu `[+/-]HH:MM`. Pokud datum neobsahuje informace o časové zóně, bude vrácen aktuální časový posun.
es: El desplazamiento se devuelve en el formato `[+/-]HH:MM`. Si no hay información de zona horaria en la fecha, entonces se devolverá el desplazamiento de la zona horaria actual.
pt_br: O offset é retornado no formato `[+/-]HH:MM`. Se nenhuma informação de fuso horário está presente na data, então o offset do fuso horário atual será retornado.

source: The return value will be -1 if `text1` comes before `text2`, 0 if they are equal and 1 if `text1` comes after `text2`.
cs: Návratová hodnota bude -1, pokud je `text1` před `text2`, 0, pokud jsou stejné, a 1, pokud je `text1` za `text2`.
es: El valor de retorno será -1 si `text1` viene antes de` text2`, 0 si son iguales y 1 si `text1` viene después de` text2`.
pt_br: O valor de retorno será -1 se `text1` vier antes de `text2`, 0 se forem iguais e 1 se `text1` vier depois de `text2`.

source: The returned number can contain fractional seconds.
cs: Vrácené číslo může obsahovat zlomky sekund.
es: El número devuelto puede contener fracciones de segundo.
pt_br: O número retornado pode conter segundos fracionados.

source: The returned words are those from `start` up to but not-including `end`. Indexes start at zero and a negative end value means that all words after the start should be returned. There is an optional final parameter `delimiters` which is string of characters used to split the text into words.
cs: Vrácená slova jsou slova od `start` až po `end`, ale bez něj. Indexy začínají nulou a záporná hodnota konce znamená, že by měla být vrácena všechna slova po začátku. K dispozici je nepovinný koncový parametr `delimiters`, což je řetězec znaků použitý k rozdělení textu na slova.
es: Las palabras devueltas son las que van desde `start` hasta `end`, pero sin incluirlas. Los índices comienzan en cero y en negativo. valor final significa que se deben devolver todas las palabras después del inicio. Hay un parámetro final opcional `delimiters` que es una cadena de caracteres utilizada para dividir el texto en palabras.
pt_br: As palavras retornadas são aquelas de `start` até, mas não incluindo, `end`. Índices começam no zero e um valor final negativo significa que todas as palavras após o início devem ser retornadas. Existe um parâmetro final opcional `delimiter` que é uma string com caracteres utilizados para dividir o texto em palavras.

source: The week is considered to start on Sunday and week containing Jan 1st is week number 1.
cs: Za začátek týdne se považuje neděle a týden obsahující 1. leden je týdnem číslo 1.
es: Se considera que la semana comienza el domingo y la semana que contiene el 1 de enero es la semana número 1.
pt_br: A semana é considerada para começar no Domingo e a semana contendo 1.º de Janeiro é a semana de número 1.

source: The week is considered to start on Sunday so a Sunday returns 0, a Monday returns 1 etc.
cs: Týden začíná nedělí, takže neděle vrací 0, pondělí 1 atd.
es: Se considera que la semana comienza el domingo, por lo que un domingo devuelve 0, un lunes devuelve 1, etc.
pt_br: A semana é considerada para iniciar no Domingo, então Domingo retorna 0, Segunda retorna 1 etc.

source: There is an optional final parameter `chars` which is string of characters to be removed instead of whitespace.
cs: K dispozici je nepovinný koncový parametr `chars`, což je řetězec znaků, které mají být odstraněny místo mezer.
es: Hay un parámetro final opcional `chars` que es una cadena de caracteres que se eliminarán en lugar de espacios en blanco.
pt_br: Existe um parâmetro final opcional `chars` que é uma string de caracters a serem removidos ao invés de espaços em branco.

source: There is an optional final parameter `delimiters` which is string of characters used to split the text into words.
cs: K dispozici je nepovinný konečný parametr `delimiters`, což je řetězec znaků, který se používá k rozdělení textu na slova.
es: Hay un parámetro final opcional `delimiters` que es una cadena de caracteres utilizada para dividir el texto en palabras.
pt_br: Existe um parâmetro final opcional `delimiters` que é uma string de caracteres utilizada para dividir o texto em palavras.

source: Tries to convert `value` to a boolean.
cs: Pokusí se převést `value` na logickou hodnotu.
es: Intenta convertir `value` a un valor booleano.
pt_br: Tenta converter `value` em um boleano.

source: Tries to convert `value` to a date.
cs: Pokusí se převést `value` na datum.
es: Intenta convertir `value` en una fecha.
pt_br: Tenta converter `value` em uma data.

source: Tries to convert `value` to a datetime.
cs: Pokusí se převést `value` na datetime.
es: Intenta convertir `value` en una fecha y hora.
pt_br: Tenta converter `value` em uma datetime.

source: Tries to convert `value` to a number.
cs: Pokusí se převést `value` na číslo.
es: Intenta convertir `value` en un número.
pt_br: Tenta converter `value` em um número.

source: Tries to convert `value` to a time.
cs: Pokusí se převést `value` na čas.
es: Intenta convertir `value` en una hora.
pt_br: Tenta converter `value` em um tempo.

source: Tries to convert `value` to text.
cs: Pokusí se převést `value` na text.
es: Intenta convertir `value` en texto.
pt_br: Tenta converter `value` em um texto.

source: Tries to parse `text` as JSON.
cs: Pokusí se analyzovat `text` jako JSON.
es: Intenta analizar el `text` como JSON.
pt_br: Tenta analisar `text` como um JSON.

source: Valid durations are "Y" for years, "M" for months, "W" for weeks, "D" for days, "h" for hour, "m" for minutes, "s" for seconds
cs: Platné délky jsou "Y" pro roky, "M" pro měsíce, "W" pro týdny, "D" pro dny, "h" pro hodiny, "m" pro minuty, "s" pro sekundy.
es: Las duraciones válidas son "Y" para años, "M" para meses, "W" para semanas, "D" para días, "h" para hora, "m" para minutos, "s" para segundos
pt_br: Durações válidas são "Y" para anos, "M" para meses, "W" para semanas, "D" para dias, "h" para hora, "m" para minutos, "s" para segundos

source: Valid durations are "Y" for years, "M" for months, "W" for weeks, "D" for days, "h" for hour, "m" for minutes, "s" for seconds.
cs: Platné doby trvání jsou "Y" pro roky, "M" pro měsíce, "W" pro týdny, "D" pro dny, "h" pro hodiny, "m" pro minuty, "s" pro sekundy.
es: Las duraciones válidas son "Y" para años, "M" para meses, "W" para semanas, "D" para días, "h" para hora, "m" para minutos, "s" para segundos.
pt_br: Durações válidas são "Y" para anos, "M" para meses, "W" para semanas, "D" para dias, "h" para hora, "m" para minutos, "s" para segundos.

source: You can optionally pass in the number of decimal places to round to as `places`.
cs: Jako `places` můžete volitelně zadat počet desetinných míst, na která se má zaokrouhlovat.
es: Opcionalmente, puede pasar el número de lugares decimales a redondear como `places`.
pt_br: Você pode, opcionalmente, passar o número de casas decimais para arredondar como `places`.

source: You can optionally pass in the number of decimal places to round to as `places`. If `places` < 0, it will round the integer part to the nearest 10^(-places).
cs: Jako `místa` můžete volitelně zadat počet desetinných míst, na která se má zaokrouhlovat. Pokud `místa` < 0, zaokrouhlí se celočíselná část na nejbližších 10^(-míst).
es: Opcionalmente, puede pasar el número de lugares decimales a redondear como `places`. Si `places` <0, redondeará la parte entera a los 10^(-places) más cercanos.
pt_br: Você pode, opcionalmente, passar o numero de casas decimais para arredondar como `places`. Se `places` < 0, ele irá arrendondar para a parte inteira do mais próxido 10^(-casas).
