Repository: istresearch/goflow
Catalog: locale/*/flows.po
Languages: cs, es, pt_br

source: A single random integer in the given inclusive range.
cs: Jedno náhodné celé číslo v zadaném rozsahu včetně.
es: Un solo entero aleatorio en el rango inclusivo dado.
pt_br: Um número aleatório simples no intervalo fornecido.

source: An error is returned if the value can't be converted.
cs: Pokud hodnotu nelze převést, je vrácena chyba.
es: Se devuelve un error si el valor no se puede convertir.
pt_br: Um erro é retornado se o valor não puder ser convertido

source: An optional third argument `humanize` can be false to disable the use of thousand separators.
cs: Nepovinný třetí argument `humanize` může být false, aby se zakázalo použití oddělovačů tisíců.
es: Un tercer argumento opcional `humanize` puede ser falso para deshabilitar el uso de separadores de miles.
pt_br: Um terceiro argumento opcional `humanize` pode ser falso para desabilitar o uso de milhares de separadores.

source: An optional third parameter `group` determines which matching group will be returned.
cs: Nepovinný třetí parametr `group` určuje, která odpovídající skupina bude vrácena.
es: Un tercer parámetro opcional `grupo` determina qué grupo coincidente se devolverá.
pt_br: Um terceiro argumento opcional `group` determina qual grupo correspondente será retornado.

source: Calculates the date value arrived at by adding `offset` number of `unit` to the `datetime`
cs: Vypočítá hodnotu data získanou přičtením čísla `offset` o `jednotku` k hodnotě `datetime`.
es: Calcula el valor de la fecha a la que se llegó agregando el número de `offset` de` unit` a `datetime`
pt_br: Calcula o valor da data de entrada adicionada por `offset`, de numero de `unit` para `datetime`

source: Capitalizes each word in `text`.
cs: Píše každé slovo v `text` velkými písmeny.
es: Escribe en mayúscula cada palabra en `text`.
pt_br: Deixa com letra maiúscula cada palavra em `text`.

source: Converts `date` to a UNIX epoch time.
cs: Převede `date` na epoch čas systému UNIX.
es: Convierte `date` en un tiempo de época de UNIX.
pt_br: Converte `date` para um UNIX epoch.

source: Converts `text` into something that can be read by IVR systems.
cs: Převádí `text` do podoby, kterou mohou číst systémy IVR.
es: Convierte `text` en algo que los sistemas IVR puedan leer.
pt_br: Converte `text` em algo que pode ser lido por sistemas IVR.

source: Converts `text` to lowercase.
cs: Převede `text` na malá písmena.
es: Convierte `text` a minúsculas.
pt_br: Converte `text` para minúsculo.

source: Converts `text` to uppercase.
cs: Převede `text` na velká písmena.
es: Convierte `text` a mayúsculas.
pt_br: Converte `text` para maiúsculo.

source: Converts the UNIX epoch time `seconds` into a new date.
cs: Převede UNIX čas epoch `sekundy` na nové datum.
es: Convierte el tiempo de época de UNIX `seconds` en una nueva fecha.
pt_br: Converte o tempo de UNIX epoch em `seconds` para uma nova data

source: Creates a date from `year`, `month` and `day`.
cs: Vytvoří datum z `rok`, `měsíc` a `den`.
es: Crea una fecha de `year`, ` month` y `day`.
pt_br: Cria uma data a partir de um `year`, `month` e `day`.

source: Creates a new array by applying `func` to each value in `values`.
cs: Vytvoří nové pole použitím `func` na každou hodnotu v `values`.
es: Crea una nueva matriz aplicando `func` a cada valor en `values`.
pt_br: Cria uma nova matriz aplicando uma `func` para cada valor em `values`.

source: Creates a new object by applying `func` to each property value of `object`.
cs: Vytvoří nový objekt použitím `func` na každou hodnotu vlastnosti `object`.
es: Crea un nuevo objeto aplicando `func` a cada valor de propiedad de `object`.
pt_br: Cria um novo objeto aplicando uma `func` para cada valor de propriedade de `object`.

source: Creates a time from `hour`, `minute` and `second`
cs: Vytvoří čas z `hour`, `minute` a `second`
es: Crea un tiempo a partir de `hour`, `minute` y `second`
pt_br: Cria um tempo a partir de `hour`, `minute` e `second`

source: Empty values are removed from the returned list. There is an optional final parameter `delimiters` which is string of characters used to split the text into words.
cs: Prázdné hodnoty jsou z vráceného seznamu odstraněny. K dispozici je nepovinný koncový parametr `delimiters`, což je řetězec znaků, který se používá k rozdělení textu na slova.
es: Los valores vacíos se eliminan de la lista devuelta. Hay un parámetro final opcional `delimiters` que es una cadena de caracteres que se utiliza para dividir el texto en palabras.
pt_br: Valores vazios são removidos por uma lista retornada. Há um parâmetro final opcional `delimiters` que é uma cadeia de caracteres utilizada para dividir o texto em palavras.

source: Encodes `text` for use as a URL parameter.
cs: Zakóduje `text` pro použití jako parametr URL.
es: Codifica `text` para utilizarlo como parámetro de URL.
pt_br: Codifica o `text` para ser usado como uma URL de parâmetro.

source: Extracts a sub-sequence of words from `text`.
cs: Extrahuje dílčí posloupnost slov z `text`.
es: Extrae una subsecuencia de palabras de `text`.
pt_br: Extrai uma sub sequência de palavras de `text`.

source: Formats `date` as text according to the given `format`.
cs: Formátuje `date` jako text podle zadaného `formátu`.
es: Formatea la `date` como texto de acuerdo con el `format` dado.
pt_br: Formata `date` como texto de acordo com o `format` dado.

source: Formats `datetime` as text according to the given `format`.
cs: Formátuje `datetime` jako text podle zadaného `formátu`.
es: Formatea `datetime` como texto de acuerdo con el `format` dado.
pt_br: Formata `datetime` para texto de acordo com o `format` dado

source: Formats `number` as a percentage.
cs: Formátuje `číslo` jako procento.
es: Formatea `number` como porcentaje.
pt_br: Formata `number` como uma porcentagem.

source: Formats `number` to the given number of decimal `places`.
cs: Formátuje `číslo` na zadaný počet desetinných míst.
es: Formatea `number` con el número dado de `places` decimales.
pt_br: Formata `number` para um dado numero de `places` decimais

source: Formats `time` as text according to the given `format`.
cs: Formátuje `čas` jako text podle zadaného `formátu`.
es: Formatea `time` como texto de acuerdo con el `format` dado.
pt_br: Formata `time` para texto de acordo com o `format` dado.

source: Formats `urn` into human friendly text.
cs: Formátuje `urn` do lidsky přívětivého textu.
es: Formatea `urn` en texto amigable para humanos.
pt_br: Formata `urn` para um texto amigável.

source: Formats `value` according to its type.
es: Formatea el `value` según su tipo.
pt_br: Formata `value` de acordo com o seu tipo.

source: Formats the given `location` as its name.
cs: Formátuje zadané `místo` jako jeho název.
es: Formatea la `location` dada como su nombre.
pt_br: Formata uma `location` dada como seu nome.

source: HTML decodes `text`
cs: HTML dekóduje `text`
es: HTML decodifica `text`
pt_br: HTML decodifica `text`

source: If `count` is omitted or is less than 0 then all occurrences are replaced.
cs: Pokud je hodnota `count` vynechána nebo je menší než 0, jsou nahrazeny všechny výskyty.
es: Si se omite `count` o es menor que 0, se reemplazan todas las ocurrencias.
pt_br: If `count` é omitido ou menor do que 0, então todas as ocorrências serão substituídas.

source: If `end` is not specified then the entire rest of `text` will be included. Negative values for `start` or `end` start at the end of `text`.
cs: Pokud není zadán `konec`, bude zahrnut celý zbytek `textu`. Záporné hodnoty pro `start` nebo `end` začínají na konci `text`.
es: Si no se especifica `end`, se incluirá el resto del `text`. Valores negativos para `start` o ` end` comienza al final de `text`.
pt_br: Se o `end` não foi especificado, então todo o resto de `text` será incluido. Valores negativos para `start` ou `end`, começarão no final do `text`.

source: If `format` is not specified then the environment's default format is used. The format string can consist of the following characters. The characters ' ', ':', ',', 'T', '-' and '_' are ignored. Any other character is an error. * `YY` - last two digits of year 0-99 * `YYYY` - four digits of year 0000-9999 * `M` - month 1-12 * `MM` - month, zero padded 01-12 * `MMM` - month Jan-Dec (localized) * `MMMM` - month January-December (localized) * `D` - day of month, 1-31 * `DD` - day of month, zero padded 01-31 * `EEE` - day of week Mon-Sun (localized) * `EEEE` - day of week Monday-Sunday (localized)
cs: Pokud není zadán `formát`, použije se výchozí formát prostředí. Formát se může skládat z následujících znaků. Znaky ' ', ':', ',', 'T', '-'. a '_' se ignorují. Jakýkoli jiný znak je chybou. * `YY` - poslední dvě číslice roku 0-99 * `YYYY` - čtyři číslice roku 0000-9999 * `M` - měsíc 1-12 * `MM` - měsíc, doplněný nulou 01-12 * `MMM` - měsíc leden-prosinec (lokalizovaný) * `MMMM` - měsíc leden-prosinec (lokalizovaný) * `D` - den v měsíci, 1-31 * `DD` - den v měsíci, doplněný nulou 01-31 * `EEE` - den v týdnu Po-Ne (lokalizováno) * `EEEE` - den v týdnu pondělí-neděle (lokalizované)
es: Si no se especifica `format`, se utiliza el formato predeterminado del entorno. El formato La cadena puede constar de los siguientes caracteres. Los caracteres '', ':', ',', 'T', '-' y '_' se ignoran. Cualquier otro carácter es un error. * `YY` - últimos dos dígitos del año 0-99 * `YYYY`: cuatro dígitos del año 0000-9999 * `M` - mes 1-12 * `MM` - mes 01-12 * `MMM` - mes ene-dic (localizado) * `MMMM` - mes enero-diciembre (localizado) * `D` - día del mes, 1-31 * `DD` - día del mes, relleno con ceros 0-31 * `EEE` - día de la semana lun-dom (localizado) * `EEEE` - día de la semana lunes-domingo (localizado)

source: If `format` is not specified then the environment's default format is used. The format string can consist of the following characters. The characters ' ', ':', ',', 'T', '-' and '_' are ignored. Any other character is an error. * `YY` - last two digits of year 0-99 * `YYYY` - four digits of year 0000-9999 * `M` - month 1-12 * `MM` - month, zero padded 01-12 * `MMM` - month Jan-Dec (localized) * `MMMM` - month January-December (localized) * `D` - day of month, 1-31 * `DD` - day of month, zero padded 01-31 * `EEE` - day of week Mon-Sun (localized) * `EEEE` - day of week Monday-Sunday (localized) * `h` - hour of the day 1-12 * `hh` - hour of the day, zero padded 01-12 * `t` - twenty four hour of the day 0-23 * `tt` - twenty four hour of the day, zero padded 00-23 * `m` - minute 0-59 * `mm` - minute, zero padded 00-59 * `s` - second 0-59 * `ss` - second, zero padded 00-59 * `fff` - milliseconds * `ffffff` - microseconds * `fffffffff` - nanoseconds * `aa` - am or pm (localized) * `AA` - AM or PM (localized) * `Z` - hour and minute offset from UTC, or Z for UTC * `ZZZ` - hour and minute offset from UTC Timezone should be a location name as specified in the IANA Time Zone database, such as "America/Guayaquil" or "America/Los_Angeles". If not specified, the current timezone will be used. An error will be returned if the timezone is not recognized.
cs: Pokud není zadán `formát`, použije se výchozí formát prostředí. Formátovací řetězec se může skládat z následujících znaků. Znaky ' ', ':', ',', 'T', '-' a '_' se ignorují. Jakýkoli jiný znak je chybou. * `YY` - poslední dvě číslice roku 0-99 * `YYYY` - čtyři číslice roku 0000-9999 * `M` - měsíc 1-12 * `MM` - měsíc, doplněný nulou 01-12 * `MMM` - měsíc leden-prosinec (lokalizovaný) * `MMMM` - měsíc leden-prosinec (lokalizovaný) * `D` - den v měsíci, 1-31 * `DD` - den v měsíci, doplněný nulou 01-31 * `EEE` - den v týdnu Po-Ne (lokalizováno) * `EEEE` - den v týdnu pondělí-neděle (lokalizované) * `h` - hodina dne 1-12 * `hh` - hodina dne, doplněná nulou 01-12 * `t` - čtyřiadvacátá hodina dne 0-23 * `tt` - čtyřiadvacet hodin dne, doplněno nulou 00-23 * `m` - minuta 0-59 * `mm` - minuta, doplněná nulou 00-59 * `s` - sekunda 0-59 * `ss` - sekunda, s nulovým polštářkem 00-59 * `fff` - milisekundy * `ffffff` - mikrosekundy * `fffffffff` - nanosekundy * `aa` - am nebo pm (lokalizované) * `AA` - AM nebo PM (lokalizované) * `Z` - hodinový a minutový posun od UTC nebo Z pro UTC * `ZZZ` - hodinový a minutový posun od UTC Časové pásmo by mělo být název lokality uvedený v databázi časových pásem IANA, například "America/Guayaquil" nebo "America/Los_Angeles". Pokud není zadáno, použije se aktuální časové pásmo. Pokud časové pásmo není rozpoznáno, bude vrácena chyba.
es: Si no se especifica `format`, se utiliza el formato predeterminado del entorno. El formato de la cadena puede constar de los siguientes caracteres. Los caracteres '', ':', ',', 'T', '-' y '_' se ignoran. Cualquier otro carácter es un error. * `YY` - últimos dos dígitos del año 0-99 * `YYYY`: cuatro dígitos del año 0000-9999 * `M` - mes 1-12 * `MM` - mes 01-12 * `MMM` - mes ene-dic (localizado) * `MMMM` - mes enero-diciembre (localizado) * `D` - día del mes, 1-31 * `DD` - día del mes, relleno con ceros 0-31 * `EEE` - día de la semana lun-dom (localizado) * `EEEE` - día de la semana lunes-domingo (localizado) * `h` - hora del día 1-12 * `hh` - hora del día 01-12 * `t` - veinticuatro horas del día 0-23 * `tt` - veinticuatro horas del día 00-23 * `m` - minuto 0-59 * `mm` - minuto 00-59 * `s` - segundo 0-59 * `ss` - segundo 00-59 * `fff` - milisegundos * `ffffff` - microsegundos * `fffffffff` - nanosegundos * `aa` - am o pm (localizado) * `AA` - AM o PM (localizado) * `Z` - compensación de hora y minuto de UTC, o Z para UTC * `ZZZ` - compensación de hora y minuto de UTC La zona horaria debe ser un nombre de ubicación como se especifica en la base de datos de la zona horaria de la IANA, como como "América / Guayaquil" o "América / Los_Angeles". Si no se especifica, la zona horaria actual se utilizará. Se devolverá un error si no se reconoce la zona horaria.

source: If `format` is not specified then the environment's default format is used. The format string can consist of the following characters. The characters ' ', ':', ',', 'T', '-' and '_' are ignored. Any other character is an error. * `h` - hour of the day 1-12 * `hh` - hour of the day, zero padded 01-12 * `t` - twenty four hour of the day 0-23 * `tt` - twenty four hour of the day, zero padded 00-23 * `m` - minute 0-59 * `mm` - minute, zero padded 00-59 * `s` - second 0-59 * `ss` - second, zero padded 00-59 * `fff` - milliseconds * `ffffff` - microseconds * `fffffffff` - nanoseconds * `aa` - am or pm (localized) * `AA` - AM or PM (localized)
cs: Pokud není zadán `formát`, použije se výchozí formát prostředí. Formátovací řetězec se může skládat z následujících znaků. Znaky ' ', ':', ',', 'T', '-' a '_' se ignorují. Jakýkoli jiný znak je chybou. * `h` - hodina dne 1-12 * `hh` - hodina dne, doplněná nulou 01-12 * `t` - čtyřiadvacátá hodina dne 0-23 * `tt` - čtyřiadvacátá hodina dne, doplněná nulou 00-23 * `m` - minuta 0-59 * `mm` - minuta, doplněná nulou 00-59 * `s` - sekunda 0-59 * `ss` - sekunda, s nulovým polštářkem 00-59 * `fff` - milisekundy * `ffffff` - mikrosekundy * `fffffffff` - nanosekundy * `aa` - am nebo pm (lokalizované) * `AA` - AM nebo PM (lokalizované)
es: Si no se especifica `format`, se utiliza el formato predeterminado del entorno. El formato de la cadena puede constar de los siguientes caracteres. Los caracteres '', ':', ',', 'T', '-' y '_' se ignoran. Cualquier otro carácter es un error. * `h` - hora del día 1-12 * `hh` - hora del día 01-12 * `t` - veinticuatro horas del día 0-23 * `tt` - veinticuatro horas del día 00-23 * `m` - minuto 0-59 * `mm` - minuto 00-59 * `s` - segundo 0-59 * `ss` - segundo 00-59 * `fff` - milisegundos * `ffffff` - microsegundos * `fffffffff` - nanosegundos * `aa` - am o pm (localizado) * `AA` - AM o PM (localizado)

source: If it is text then it will be parsed into a date using the default date format. An error is returned if the value can't be converted.
cs: Pokud se jedná o text, bude zpracován na datum s použitím výchozího formátu data. Pokud hodnotu nelze převést, je vrácena chyba.
es: Si es texto, se analizará en una fecha utilizando el formato de fecha predeterminado. Se devuelve un error si el valor no se puede convertir.
pt_br: Se for texto, então isso será analisado para uma data utilizando o formato padrão. Um erro é retornado se o valor não puder ser convertido.

source: If it is text then it will be parsed into a datetime using the default date and time formats. An error is returned if the value can't be converted.
cs: Pokud se jedná o text, bude zpracován na datum s použitím výchozího formátu data a času. Pokud hodnotu nelze převést, je vrácena chyba.
es: Si es texto, se analizará en una fecha y hora usando la fecha predeterminada y formatos de hora. Se devuelve un error si el valor no se puede convertir.
pt_br: Se for texto, então isso será analisado para uma data/hora utilizando o formato padrão e formatos de tempo. Um erro é retornado se o valor não puder ser convertido.

source: If it is text then it will be parsed into a time using the default time format. An error is returned if the value can't be converted.
cs: Pokud se jedná o text, bude zpracován na čas s použitím výchozího formátu času. Pokud hodnotu nelze převést, je vrácena chyba.
es: Si es texto, se analizará como un tiempo utilizando el formato de tiempo predeterminado. Se devuelve un error si el valor no se puede convertir.
pt_br: Se for texto, então será analisado para um tempo utilizando o formato padrão. Um erro é retornado se o valor não puder ser convertido.

source: If no timezone information is present in the date, then the current timezone will be returned.
cs: Pokud datum neobsahuje informace o časovém pásmu, bude vráceno aktuální časové pásmo.
es: Si no hay información sobre la zona horaria en la fecha, se devolverá la zona horaria actual.
pt_br: Se não existe informação presente de fuso horário na data, então o fuso horário atual será retornado.

source: If the first argument is an error that error is returned.
cs: Pokud je prvním argumentem chyba, je tato chyba vrácena.
es: Si el primer argumento es un error, ese error se devuelve.
pt_br: Se o primeiro argumento é um erro, esse é retornado.

source: If the given `text` is not valid JSON, then an error is returned
cs: Pokud zadaný `text` není platný JSON, je vrácena chyba.
es: Si el `text` proporcionado no es JSON válido, se devuelve un error
pt_br: Se o texto dado não é um JSON válido, então um erro é retornado.

source: If the given function takes more than one argument, you can pass additional arguments after the function.
cs: Pokud daná funkce přijímá více než jeden argument, můžete za funkci předat další argumenty.
es: Si la función dada toma más de un argumento, puede pasar argumentos adicionales después de la función.
pt_br: Se a função dada leva mais de um argumento, você pode passar argumentos adicionais após a função.

source: Indexes start at zero. There is an optional final parameter `delimiters` which is string of characters used to split the text into words.
cs: Indexy začínají od nuly. K dispozici je nepovinný poslední parametr `delimiters`, což je řetězec znaků, který se používá k rozdělení textu na slova.
es: Los índices comienzan en cero. Hay un parámetro final opcional `delimiters` que es una cadena de caracteres que se utiliza para dividir el texto en palabras.
pt_br: Índices começam em zero. Há um parâmetro final opcional `delimiters` que é uma cadeia de caracteres usada para separar o texto em palavras.

source: It is the inverse of [function:char].
cs: Je inverzní k [function:char].
es: Es el inverso de [function:char].
pt_br: Isso é o inverso de [function:char]

source: It is the inverse of [function:code].
cs: Je inverzní k [function:code].
es: Es el inverso de [function:code].
pt_br: Isso é o inverso de [function:code]

source: It will return an error if it is passed an item which isn't countable.
cs: Pokud bude předána položka, která není spočitatelná, vrátí chybu.
es: Devolverá un error si se le pasa un artículo que no es contable.
pt_br: Isso retornará um erro se for passado um item que não é contabilizável.

source: Joins the given `array` of strings with `separator` to make text.
cs: Spojí zadaný řetězec `array` s `separator` a vytvoří z něj text.
es: Une la `array` de cadenas dada con `separator` para crear texto.
pt_br: Junta o `array` dado de strings com o `separator` para fazer o texto.

source: Parses `text` into a date using the given `format`.
cs: Zpracuje `text` na datum pomocí zadaného `format`.
es: Analiza el `text` en una fecha usando el `format` dado.
pt_br: Analisa o `text` em uma data usando um `format` dado.

source: Parses `text` into a time using the given `format`.
cs: Zpracuje `text` do času pomocí zadaného `format`.
es: Analiza el `text` en un tiempo usando el` formato` dado.
pt_br: Analisa o `text` em um tempo usando o `format` dado.

source: Parses a URN into its different parts
cs: Rozebere URN na jednotlivé části
es: Analiza una URN en sus diferentes partes
pt_br: Analise uma URN em suas diferentes partes

source: Parses an attachment into its different parts
cs: Rozebere přílohu na jednotlivé části
es: Analiza un archivo adjunto en sus diferentes partes
pt_br: Analisa um anexo em suas diferentes partes

source: ReadChars will split the numbers such as they are easier to understand. This includes splitting in 3s or 4s if appropriate.
cs: ReadChars rozdělí čísla tak, aby byla srozumitelnější. To zahrnuje i dělení na 3 nebo 4 části, pokud je to vhodné.
es: ReadChars dividirá los números para que sean más fáciles de entender. Esto incluye dividir en 3 o 4 si es apropiado.
pt_br: ReadChars irá dividir os números de forma que fiquem fáceis de entender. Isso inclui dividor em 3s ou 4s se apropriado.

source: Removes any non-printable characters from `text`.
cs: Odstraní z `text` všechny netisknutelné znaky.
es: Elimina cualquier carácter no imprimible de `text`.
pt_br: Remove quaisquer caracteres não imprimíveis do `text`.

source: Removes the first word of `text`.
cs: Odstraní první slovo v `text`.
es: Elimina la primera palabra de `text`.
pt_br: Remove a primeira palavra do `text`.

source: Removes whitespace from either end of `text`.
cs: Odstraní mezery z obou konců `text`.
es: Elimina los espacios en blanco de cualquier extremo de `text`.
pt_br: Remove espaço em branco de qualquer uma das extremidades do `text`.

source: Removes whitespace from the end of `text`.
cs: Odstraní mezery z konce `text`.
es: Elimina los espacios en blanco del final de `text`.
pt_br: Remove espaço em branco do final do `text`.

source: Removes whitespace from the start of `text`.
cs: Odstraní mezery z konce `text`.
es: Elimina los espacios en blanco del inicio de `text`.
pt_br: Remove espaço em branco do começo do `text`.

source: Replaces up to `count` occurrences of `needle` with `replacement` in `text`.
cs: Nahradí až `count` výskytů `needle` pomocí `replacement` v `text`.
es: Reemplaza hasta `count` apariciones de `needle` con `replacement` en `text`.
pt_br: Substitui até em até `count` ocorrências de `needle` por `replacement` em `text`.

source: Returns `text` repeated `count` number of times.
cs: Vrací `text` opakovaný `count` krát.
es: Devuelve `text` repetido `count` veces.
pt_br: Retorna `text` repetido `count` número de vezes.

source: Returns `value1` if `test` is truthy or `value2` if not.
cs: Vrací `value1`, pokud je `test` pravdivý, nebo `value2`, pokud není.
es: Devuelve `value1` si `test` es veraz o `value2` si no.
pt_br: Retorna `value1` se `test` é verdadeiro ou `value2` caso contrário.

source: Returns `value` if is not empty or an error, otherwise it returns `default`.
cs: Vrací `value`, pokud není prázdný nebo se jedná o chybu, jinak vrací `default`.
es: Devuelve `value` si no está vacío o es un error; de lo contrario, devuelve `default`.
pt_br: Retorna `value` se não for vazio ou erro, de outra forma retorna `default`.
